# RebarPropagation Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarPropagation Class
Members See Also
---
An utility class containing functions that can be used to propagate rebar elements.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public static class RebarPropagation
```

Visual Basic
---
```text
Public NotInheritable Class RebarPropagation
```

Visual C++
---
```text
public ref class RebarPropagation abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..RebarPropagation
# See Also
RebarPropagation Members
Autodesk.Revit.DB.Structure Namespace